.emacs.d/jeroen.org
* packages to look up

look up (py) documentation:
https://stackoverflow.com/questions/45992859/how-to-read-python-documentation-in-emacs
code nav: helm
save window configs/workspaces: eyebrowse

* basic emacs

disable that big old yellow triangle in the center of the screen:

#+BEGIN_SRC emacs-lisp
(setq visible-bell t)
#+END_SRC

#+RESULTS:

be able to dynamically create functions:

#+BEGIN_SRC emacs-lisp
(defun define-named-lambda (name lambd args)
  (defalias (intern name) `(lambda () (interactive) (apply ,lambd ',args))))

(defun define-custom-function (name func)
  (define-named-lambda name (lambda () (funcall func))))
#+END_SRC

#+RESULTS:
: define-custom-function

* ssh shortcuts

fns to reset directories to local:
#+BEGIN_SRC emacs-lisp
(defun local ()
  (interactive)
  (setq default-directory "/Users/jeroen"))

(defun reset-default-directory ()
  (interactive)
  (setq-local default-directory (file-name-directory (buffer-file-name))))

(defun open-shell-in-directory (directory &optional buffername)
  (interactive)
  (message "osid")
  (message directory)
  (message buffername)
  (with-temp-buffer
    (setq default-directory directory)
    (shell buffername)
    )
)
#+END_SRC

#+RESULTS:
: open-shell-in-directory

add remote endpoints

#+BEGIN_SRC emacs-lisp
(setq ssh-config '(
                   ("fxr" "/plink:jeroen@168.119.165.84:")
                   ("lisa-dl" "/plink:lgpu0348@lisa.surfsara.nl:")
                  ))

(dolist (elt ssh-config)
  (define-named-lambda
    (nth 0 elt)
    (lambda (directory)
      (interactive)
      (setq default-directory directory))
    '((nth 1 elt))
    )
  (define-named-lambda
    (s-concat "shell-" (nth 0 elt))
    (lambda (name directory)
      (interactive)
      (open-shell-in-directory directory (s-concat "*shell-" name "*")))
    elt
    )
)
#+END_SRC

#+RESULTS:

* better keybindings

copy/cut entire line if no region selected:
#+BEGIN_SRC emacs-lisp
(defun slick-cut (beg end)
  (interactive
   (if mark-active
       (list (region-beginning) (region-end))
     (message "Cut line")
     (list (line-beginning-position) (line-beginning-position 2)))))

(advice-add 'kill-region :before #'slick-cut)

(defun slick-copy (beg end)
  (interactive
   (if mark-active
       (list (region-beginning) (region-end))
     (message "Copied line")
     (list (line-beginning-position) (line-beginning-position 2)))))

(advice-add 'kill-ring-save :before #'slick-copy)
#+END_SRC

#+RESULTS:

move windows with arrow keys (i know...)

#+BEGIN_SRC emacs-lisp
(bind-key* "M-<left>"  'windmove-left)
(bind-key* "M-<right>" 'windmove-right)
(bind-key* "M-<up>"    'windmove-up)
(bind-key* "M-<down>"  'windmove-down)
#+END_SRC

#+RESULTS:
: windmove-down

switch buffer with =C-j=:

#+BEGIN_SRC emacs-lisp
(bind-key* "C-j" 'ivy-switch-buffer)
#+END_SRC

#+RESULTS:
: ivy-switch-buffer

* dired

#+BEGIN_SRC emacs-lisp
  (require 'dired-x)

  (setq dired-omit-files
        (concat dired-omit-files
                "\\|"
                (regexp-orrify "\\.orgx$"
                               "^\.DS_Store$"
                               "^__MACOSX$"
                               "\\.pyc$"
                               "\\.pyo$"
                               "^__pycache__"
                               ".ipynb_checkpoints"
                               "\\.lprof$"
                               "\\.bak$"
                               "^ltximg$"
                               "^\\.~lock\\."
                               "^!.*pdf$"
                               "\\.~.*#")))

  (add-hook 'dired-mode-hook
            #'(lambda ()
                (setq dired-guess-shell-alist-user
                      '(("\\.e?ps$" "gv" "lpr")
                        ("\\.pdf$" "mupdf" "xpdf" "lp" "acroread")
                        ("\\.mobi$" "ebook-viewer")
                        ("\\.epub$" "ebook-viewer")
                        ("\\.djvu$" "ebook-viewer")
                        ("\\.csv$" "loffice" "gnumeric")
                        ("\\.docx?$" "loffice")
                        ("\\.xlsx?$" "loffice" "gnumeric")
                        ("\\.pptx?$" "loffice")
                        ("\\.od[spt]$" "loffice")
                        ("\\.divx$" "mplayer")
                        ("\\.flv$" "mplayer")
                        ("\\.avi$" "mplayer")
                        ("\\.mpg$" "mplayer")
                        ("\\.mp4$" "mplayer")
                        ("\\.wmv$" "mplayer")
                        ("\\.mkv$" "mplayer")
                        ("\\.mov$" "mplayer")
                        ("\\.webm$" "mplayer")
                        ("Flash......$" "mplayer")
                        ("mplay......$" "mplayer")
                        ("\\.p[bgpn]m$" "geeqie" "display")
                        ("\\.gif$" "geeqie" "display")
                        ("\\.tif$" "geeqie" "display")
                        ("\\.png$" "geeqie" "display")
                        ("\\.jpe?g$" "geeqie" "display")
                        ("\\.svg$" "geeqie" "display")
                        ("\\.e?ps.g?z$" "gunzip -qc * | gv -"
                         (concat
                          "gunzip"
                          (if dired-guess-shell-gzip-quiet " -q")))
                        ("\\.e?ps.Z$" "zcat * | gv -"
                         (concat "znew"
                                 (if dired-guess-shell-gzip-quiet " -q")
                                 " " dired-guess-shell-znew-switches))
                        ("viewapp.asp" "xpdf"))
                      dired-listing-switches "-alh")
                (local-set-key "\C-c\C-zf" 'browse-url-of-dired-file)
                (dired-omit-mode)
                (whitespace-mode -1)))

    ;; Auto complete with ignore case
    (setq-default read-buffer-completion-ignore-case t)
    (setq-default read-file-name-completion-ignore-case t)
#+END_SRC

show filesize as kb, mb, etc:

#+BEGIN_SRC emacs-lisp
(setq dired-listing-switches "-alh")
#+END_SRC

* s (string manipulation)

#+BEGIN_SRC emacs-lisp
(require 's)
#+END_SRC

#+RESULTS:
: s

* a bunch of stuffs

add org elpa to package archive
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
#+END_SRC

#+RESULTS:
: ((melpa . http://melpa.org/packages/) (gnu . https://elpa.gnu.org/packages/) (melpa . https://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/) (melpa . https://stable.melpa.org/packages/) (org . https://orgmode.org/elpa/))

enable org-mode auto-fill-mode and org-indent-mode automatically:

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'auto-fill-mode)
(add-hook 'org-mode-hook 'org-indent-mode)
#+END_SRC



#+BEGIN_SRC emacs-lisp
;; (defun move-line-up ()
;;   "Move up the current line."
;;   (interactive)
;;   (transpose-lines 1)
;;   (forward-line -2)
;;   (indent-according-to-mode))

;; (defun move-line-down ()
;;   "Move down the current line."
;;   (interactive)
;;   (forward-line 1)
;;   (transpose-lines 1)
;;   (forward-line -1)
;;   (indent-according-to-mode))

;; (global-set-key [(meta up)]  'move-line-up)
;; (global-set-key [(meta down)]  'move-line-down)

(defun duplicate-line()
  (interactive)
  (move-beginning-of-line 1)
  (kill-line)
  (yank)
  (open-line 1)
  (next-line 1)
  (yank)
)
(global-set-key (kbd "C-c C-d") 'duplicate-line)

;; drag-stuff


(defun emacs-gitignore  ()
  (interactive)
  (let ((fullpath (string-join (list default-directory ".gitignore"))))
    (if (file-exists-p fullpath)
        (progn
          (shell-command-to-string "curl 'https://raw.githubusercontent.com/github/gitignore/master/Global/Emacs.gitignore' >> .gitignore")
          (message (format "Added emacs-gitignore in %s" default-directory))))))

  ;; (yank)

  ;;     (shell-command-to-string "curl 'https://raw.githubusercontent.com/github/gitignore/master/Global/Emacs.gitignore' >> .gitignore")
  ;; (message (format "Added gitignore in %s" default-directory))
;; )
#+END_SRC

#+RESULTS:
| (lambda nil (yas-activate-extra-mode (quote fundamental-mode))) | yas-minor-mode-set-explicitly |

#+BEGIN_SRC emacs-lisp
;;  (require 'hydra)
;; (defhydra hydra-zoom (global-map "M")
;;   "zoom"
;;   ("g" text-scale-increase "in")
;;  ("l" text-scale-decrease "out"))
;; (drag-stuff-mode)
;; (defhydra hydra-zoom (global-map "<f2>")
;;   "zoom"
;;   ("g" text-scale-increase "in")
;;   ("l" text-scale-decrease "out"))
(define-key indent-rigidly-map (drag-stuff--kbd 'left) 'drag-stuff-left)
(define-key indent-rigidly-map (kbd "C-p") 'drag-stuff-up)
(define-key indent-rigidly-map (kbd "C-n") 'drag-stuff-down)
(define-key indent-rigidly-map (kbd "C-f") 'drag-stuff-right)
(define-key indent-rigidly-map (kbd "C-b") 'drag-stuff-left)
(drag-stuff-mode)
#+END_SRC

#+RESULTS:
: drag-stuff-left

