.emacs.d/jeroen.org
* keybase

run: =git clone https://github.com/paulodder/keybase-chat=

#+BEGIN_SRC emacs-lisp
(setq my-keybase-username "jpj8")
(add-to-list 'load-path "~/.emacs.d/keybase-chat/")
;; (add-to-list 'load-path "~/.emacs.d/zone-matrix")
;; (require 'zone-matrix)
(load-file "~/.emacs.d/keybase-chat/keybase-chat.el")
(load-file "~/.emacs.d/keybase-chat/keybase-markup.el")
(require 'keybase)
#+END_SRC

#+RESULTS:
: t

* avy
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-;") 'avy-goto-char-2)
#+END_SRC

#+RESULTS:
: avy-goto-char-2
* org-mode

Change the size of inline latex eqs (=C-x C-c C-l=).

#+BEGIN_SRC emacs-lisp
(plist-put org-format-latex-options :scale 1.8)
#+END_SRC

#+RESULTS:

In order to create those images when opening org file, insert this:
=#+STARTUP: latexpreview=.

** copy src block

#+BEGIN_SRC emacs-lisp
(defun org-copy-src-block ()
  (interactive)
  (org-edit-src-code)
  (mark-whole-buffer)
  (kill-ring-save)
  (org-edit-src-abort))

(define-key org-mode-map (kbd "C-M-w") 'org-copy-src-block))
#+END_SRC

#+RESULTS:
: org-copy-src-block

** edit random comments and strings with org-mode

If you wanna edit some large comment (e.g. docstring) using org-mode editing
ease, use this:

#+BEGIN_SRC emacs-lisp
(use-package poporg
      :bind (("C-c /" . poporg-dwim)))
#+END_SRC

#+RESULTS:
: poporg-dwim

** org to ipynb

#+BEGIN_SRC emacs-lisp
;; (add-to-list 'load-path "~/.emacs.d/github/ox-ipynb")
;; (require 'ox-ipynb)
#+END_SRC

#+RESULTS:
: ox-ipynb
* shell
#+BEGIN_SRC emacs-lisp
(defun set-bash () (interactive) (setq explicit-shell-file-name "/bin/bash"))
(defun set-zsh () (interactive) (setq explicit-shell-file-name "/bin/zsh"))
#+END_SRC

#+RESULTS:
: set-zsh

* python
#+BEGIN_SRC emacs-lisp
;; (define-key dump-jump-mode-map (kbd "C-M-p") nil)
;; python-indent-dedent-line-backspace
      (use-package python
        :ensure t
        :mode ("\\.py\\'" . python-mode)
        :interpreter ("python" . python-mode)
        :config
        (setq python-shell-interpreter "ipython"
        ;; python-shell-interpreter-args "--simple-prompt -i --colors=Linux --profile=default")
          python-shell-interpreter-args "")
              (push '("\\.ipynb$" . js2-mode) auto-mode-alist)
        :hook
        (python-mode . (lambda ()
                         "No eldoc for remote files"
                         (let ((name (buffer-file-name)))
                           (when (and name
                                      (> (length name) 5)
                                      (string= "/ssh:" (substring name 0 5)))
                             (eldoc-mode -1))))))

  (setq py-shell-name "ipython")

              ;; python-shell-interpreter-args "--simple-prompt -i")
    ;; (defcustom py-shell-name
    ;;   (if (eq system-type 'windows-nt)
    ;;       "C:/Python27/python"
    ;;     ;; "python"
    ;;     "ipython")

    ;; ;;   "A PATH/TO/EXECUTABLE or default value `py-shell' may look for.

    ;; ;; If no shell is specified by command.

    ;; ;; On Windows default is C:/Python27/python
    ;; ;; --there is no garantee it exists, please check your system--

    ;; ;; Else python"
    ;; ;;   :type 'string
    ;; ;;   :tag "py-shell-name"
    ;; ;;   :group 'python-mode)
#+END_SRC

#+RESULTS:
: ipython

** blacken
use-package doesn't seem to work with blacken

#+BEGIN_SRC emacs-lisp
(require 'blacken)
(setq blacken-line-length 79)
(setq blacken-executable "/Users/jeroen/.virtualenvs/py3.8/bin/black")
(add-hook 'python-mode-hook 'blacken-mode 'too-long-lines-mode)

(define-advice org-edit-src-exit (:before (&rest _args) format-python)
  "Run `blacken-buffer' when leaving an org-mode Python source block."
  (when (eq major-mode 'python-mode)
    (blacken-buffer)))

;; (use-package blacken
;;   :ensure t
;;   :bind (:map python-mode-map ("C-c C-b" . blacken-buffer))
;;   :config
;;   (setq blacken-line-length 80)
;;   (add-hook 'python-mode-hook 'blacken-mode))
#+END_SRC

#+RESULTS:
: org-edit-src-exit@format-python

** python jedi (unused)
1. From emacs-jedi readme
#+BEGIN_SRC emacs-lisp
;; (setq jedi:server-command '("pip3" "/Users/jeroen/.emacs.d/.python-environments/default/bin/jediepcserver"))

#+END_SRC

#+RESULTS:

2. Then open Python file.
#+BEGIN_SRC emacs-lisp
;;; Python Jedi
;;; From emacs-jedi readme
;; Type:
;;     M-x jedi:install-server RET
;; Then open Python file.
;; (use-package jedi
;;   :ensure t
;;   ;; :disabled nil
;;   :defer 3
;;   :config
;;   ;; Standard Jedi.el setting
;;   (add-hook 'python-mode-hook 'jedi:setup)
;;   (setq jedi:complete-on-dot t))
#+END_SRC

#+RESULTS:

** elpy
#+BEGIN_SRC emacs-lisp
  (use-package elpy
    :ensure t
    :diminish elpy-mode
    :config (elpy-enable))

    ;; (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)

    (custom-set-variables
     ;; sudo dnf install python-jedi python3-jedi -y
     ;; '(elpy-rpc-backend "jedi")
     '(help-at-pt-display-when-idle (quote (flymake-overlay)) nil (help-at-pt))
     '(help-at-pt-timer-delay 0.9)
     '(tab-width 2))

    ;; Do not highlight indentation
    ;; (delete 'elpy-module-highlight-indentation elpy-modules)
    ;; )
(setq elpy-eldoc-show-current-function nil)
#+END_SRC

#+RESULTS:

