.emacs.d/jeroen.el

(push '("\\.xsh$" . python-mode) auto-mode-alist)
